Repository: Nadav23AnT/travel-assistant-ai
Catalog: lib/l10n/app_*.arb
Languages: he

source: Home
he: בית

# appTitle
source: Waylo
he: TripBuddy

# welcomeGreetingMorning
source: Good morning,
he: בוקר טוב,

# welcomeGreetingAfternoon
source: Good afternoon,
he: צהריים טובים,

# welcomeGreetingEvening
source: Good evening,
he: ערב טוב,

source: No Active Trip
he: אין טיול פעיל

# startPlanningAdventure
source: Start planning your next adventure!
he: התחל לתכנן את ההרפתקה הבאה שלך!

source: Create New Trip
he: צור טיול חדש

source: Quick Actions
he: פעולות מהירות

source: New Trip
he: טיול חדש

source: Add Expense
he: הוסף הוצאה

source: AI Chat
he: צ'אט AI

source: Recent Chats
he: צ'אטים אחרונים

source: Recent Expenses
he: הוצאות אחרונות

source: View All
he: צפה בהכל

# startConversation
source: Start a conversation with Waylo!
he: התחל שיחה עם TripBuddy!

source: New Chat
he: צ'אט חדש

# noExpensesRecorded
source: No expenses recorded yet
he: לא נרשמו הוצאות

source: Today
he: היום

source: Yesterday
he: אתמול

source: Dates
he: תאריכים

source: Dates not set
he: תאריכים לא נקבעו

source: Duration
he: משך

source: Not set
he: לא נקבע

source: Starts in
he: מתחיל בעוד

source: Status
he: סטטוס

source: Completed
he: הושלם

source: Current
he: נוכחי

source: day
he: יום

source: days
he: ימים

# dayOfTotal
source: Day {current} of {total}
he: יום {current} מתוך {total}

source: Create Trip
he: צור טיול

source: Save
he: שמור

source: Cancel
he: ביטול

source: Delete
he: מחק

source: Edit
he: ערוך

source: Confirm
he: אשר

source: Trip Title
he: שם הטיול

# tripTitleHint
source: e.g., Paris Adventure 2025
he: לדוגמה: הרפתקה בפריז 2025

# tripTitleRequired
source: Please enter a trip title
he: נא להזין שם טיול

source: Destination
he: יעד

# destinationHint
source: Start typing a country...
he: התחל להקליד מדינה...

# destinationRequired
source: Please select a destination
he: נא לבחור יעד

source: Trip Dates
he: תאריכי הטיול

source: Select dates
he: בחר תאריכים

# pleaseSelectDates
source: Please select trip dates
he: נא לבחור תאריכי טיול

source: Budget
he: תקציב

source: Currency
he: מטבע

source: Description
he: תיאור

# descriptionHint
source: What are you excited about for this trip?
he: מה מרגש אותך בטיול הזה?

source: Smart Budget Suggestions
he: הצעות תקציב חכמות

# smartBudgetInstructions
source: After choosing a destination and trip dates, the app will automatically suggest an average traveler budget for this trip.
he: לאחר בחירת יעד ותאריכים, האפליקציה תציע אוטומטית תקציב ממוצע למטיילים.

source: Estimated daily budget:
he: תקציב יומי משוער:

# basedOnAverageTravelers
source: Based on average travelers in {destination}.
he: מבוסס על מטיילים ממוצעים ב{destination}.

# totalForDays
source: Total for {days} days: {amount} {currency}
he: סה"כ ל{days} ימים: {amount} {currency}

source: Apply
he: החל

source: Trip Preview
he: תצוגה מקדימה

# tripCreatedSuccess
source: Trip to {destination} created!
he: טיול ל{destination} נוצר!

source: Failed to create trip
he: נכשל ביצירת הטיול

source: Expenses
he: הוצאות

source: Amount
he: סכום

source: Category
he: קטגוריה

source: Date
he: תאריך

source: Notes
he: הערות

# categoryTransport
source: Transport
he: תחבורה

# categoryAccommodation
source: Accommodation
he: לינה

# categoryFood
source: Food
he: אוכל

# categoryActivities
source: Activities
he: פעילויות

# categoryShopping
source: Shopping
he: קניות

# categoryOther
source: Other
he: אחר

source: Chat
he: צ'אט

# typeMessage
source: Type a message...
he: הקלד הודעה...

source: Send
he: שלח

source: Trips
he: טיולים

source: My Trips
he: הטיולים שלי

source: Upcoming Trips
he: טיולים קרובים

source: Past Trips
he: טיולים שעברו

source: Active Trip
he: טיול פעיל

source: Profile
he: פרופיל

source: Settings
he: הגדרות

source: Sign Out
he: התנתק

source: Sign In
he: התחבר

source: Sign Up
he: הירשם

source: Email
he: דוא"ל

source: Password
he: סיסמה

source: Full Name
he: שם מלא

# generalSettings
source: General
he: כללי

source: App Language
he: שפת האפליקציה

source: Default Currency
he: מטבע ברירת מחדל

source: Date Format
he: פורמט תאריך

source: Distance Units
he: יחידות מרחק

source: Kilometers
he: קילומטרים

source: Miles
he: מיילים

source: Dark Mode
he: מצב כהה

source: Notifications
he: התראות

source: Push Notifications
he: התראות Push

source: Email Notifications
he: התראות בדוא"ל

source: Trip Reminders
he: תזכורת טיול

source: Privacy
he: פרטיות

# shareAnalytics
source: Share Usage Analytics
he: שיתוף ניתוח שימוש

source: Location Tracking
he: מעקב מיקום

source: Account
he: חשבון

source: Change Password
he: שנה סיסמה

# exportData
source: Export My Data
he: ייצא את הנתונים שלי

source: Delete Account
he: מחק חשבון

# deleteAccountConfirmation
source: Are you sure you want to delete your account? This action cannot be undone.
he: האם אתה בטוח שברצונך למחוק את החשבון? פעולה זו לא ניתנת לביטול.

source: About
he: אודות

source: App Version
he: גרסה

source: Terms of Service
he: תנאי שימוש

source: Privacy Policy
he: מדיניות פרטיות

# rateApp
source: Rate the App
he: דרגו את האפליקציה

source: Error
he: שגיאה

# errorOccurred
source: An error occurred
he: אירעה שגיאה

source: Try Again
he: נסה שוב

source: Loading...
he: טוען...

source: No date
he: אין תאריך

source: Failed to load chats
he: נכשל בטעינת צ'אטים

source: Failed to load expenses
he: נכשל בטעינת הוצאות

source: Reset Data
he: אפס נתונים

# resetDataTitle
source: Reset User Data
he: איפוס נתונים

# resetDataMessage
source: This will delete all your trips and reset the onboarding status. You will be redirected to start the onboarding process again. This action cannot be undone.
he: זה ימחק את כל הטיולים שלך ויאפס את מצב ההתחלה. תופנה להתחיל את תהליך ההתחלה מחדש. פעולה זו אינה ניתנת לביטול.

source: Reset
he: אפס

# dayTip
source: Today's Travel Tip
he: טיפ יומי

# dayTipDescription
source: AI-powered travel recommendations
he: המלצות טיול מבוססות AI

source: Refresh Tip
he: רענן טיפ

# onboardingWelcome
source: Welcome to Waylo
he: ברוכים הבאים ל-TripBuddy

# onboardingLanguageTitle
source: Choose Your Language
he: בחר את השפה שלך

# onboardingLanguageSubtitle
source: Select your preferred language for the app
he: בחר את השפה המועדפת לאפליקציה

# continueButton
source: Continue
he: המשך

source: Skip
he: דלג

source: Get Started
he: התחל

# languageEnglish
source: English
he: אנגלית

# languageSpanish
source: Spanish
he: ספרדית

# languageFrench
source: French
he: צרפתית

# languageGerman
source: German
he: גרמנית

# languageHebrew
source: Hebrew
he: עברית

# languageJapanese
source: Japanese
he: יפנית

# languageChinese
source: Chinese
he: סינית

# languageKorean
source: Korean
he: קוריאנית

# languageItalian
source: Italian
he: איטלקית

# languagePortuguese
source: Portuguese
he: פורטוגזית

# languageRussian
source: Russian
he: רוסית

# languageArabic
source: Arabic
he: ערבית

# chatHint
source: Ask me anything about travel...
he: שאל אותי כל דבר על טיולים...

source: Delete Chat
he: מחק צ'אט

# deleteChatConfirmation
source: Are you sure you want to delete this chat?
he: האם אתה בטוח שברצונך למחוק את הצ'אט הזה?

source: Expense added!
he: ההוצאה נוספה!

source: Failed to add expense
he: נכשל בהוספת הוצאה

# chatWelcomeTitle
source: Hey there, traveler!
he: היי מטייל!

# chatWelcomeDescription
source: I'm Waylo, your travel companion! I'm here to help you document your adventures, plan activities, and create a beautiful travel journal.
he: אני TripBuddy, המלווה שלך לטיול! אני כאן כדי לעזור לך לתעד את ההרפתקאות שלך, לתכנן פעילויות, וליצור יומן טיול יפהפה.

# chatWhatToDo
source: What would you like to do?
he: מה תרצה לעשות?

# tellAboutDay
source: Tell me about your day
he: ספר לי על היום שלך

# tellAboutDayDescription
source: Share what you did, saw, or experienced
he: שתף מה עשית, ראית או חווית

# tellAboutDayPrompt
source: Let me tell you about my day today...
he: בוא אספר לך על היום שלי היום...

# planActivity
source: Plan an activity
he: תכנן פעילות

# planActivityDescription
source: Get recommendations for things to do
he: קבל המלצות לדברים לעשות

# planActivityPrompt
source: What are some good activities I should do here?
he: מהן כמה פעילויות טובות שכדאי לי לעשות כאן?

# logExpenseAction
source: Log an expense
he: רשום הוצאה

# logExpenseDescription
source: Track spending on your trip
he: עקוב אחר הוצאות בטיול

# logExpensePrompt
source: I want to log an expense
he: אני רוצה לרשום הוצאה

# generateJournal
source: Generate my journal
he: צור את היומן שלי

# generateJournalDescription
source: Create today's travel journal entry
he: צור את רשומת יומן הטיול של היום

# generateJournalPrompt
source: Help me write my travel journal for today
he: עזור לי לכתוב את יומן הטיול שלי להיום

source: Ask anything
he: שאל כל דבר

# askAnythingDescription
source: Travel tips, local info, recommendations
he: טיפים לטיול, מידע מקומי, המלצות

source: AI Chats
he: צ'אטים AI

source: Start New Chat
he: התחל צ'אט חדש

source: AI Travel Assistant
he: עוזר טיולים AI

# aiTravelAssistantDescription
source: Start a conversation with your AI travel buddy to plan trips, get recommendations, and more!
he: התחל שיחה עם חבר הטיולים ה-AI שלך כדי לתכנן טיולים, לקבל המלצות ועוד!

source: Retry
he: נסה שוב

source: Error deleting chat
he: שגיאה במחיקת צ'אט

# todayAt
source: Today at {time}
he: היום ב-{time}

# yesterdayAt
source: Yesterday at {time}
he: אתמול ב-{time}

# deleteChatTitle
source: Delete "{title}"? This cannot be undone.
he: למחוק את "{title}"? לא ניתן לבטל פעולה זו.

source: Error creating chat
he: שגיאה ביצירת צ'אט

source: Error loading chat
he: שגיאה בטעינת צ'אט

# createTripForTips
source: Create a trip to get daily tips!
he: צור טיול כדי לקבל טיפים יומיים!

source: Overview
he: סקירה כללית

# expensesCount
source: {count} expenses
he: {count} הוצאות

# daysTracked
source: {count} days tracked
he: {count} ימים נמדדו

# dayTrip
source: {count} day trip
he: טיול של {count} ימים

# daysLeft
source: {count} days left
he: נותרו {count} ימים

source: By Category
he: לפי קטגוריה

source: Spending Over Time
he: הוצאות לאורך זמן

source: No Expenses Yet
he: עדיין אין הוצאות

# startTrackingExpenses
source: Start tracking your travel expenses by adding your first expense.
he: התחל לעקוב אחר הוצאות הטיול שלך על ידי הוספת ההוצאה הראשונה.

source: Something went wrong
he: משהו השתבש

source: Home Currency
he: מטבע בית

source: US Dollar
he: דולר אמריקאי

source: Local Currency
he: מטבע מקומי

# foodAndDrinks
source: Food & Drinks
he: אוכל ושתייה

# pleaseSelectTrip
source: Please select a trip
he: אנא בחר טיול

# expenseAddedSuccess
source: Expense added successfully!
he: ההוצאה נוספה בהצלחה!

# noTripsFound
source: No trips found. Create a trip first to add expenses.
he: לא נמצאו טיולים. צור טיול קודם כדי להוסיף הוצאות.

source: Trip
he: טיול

# pleaseEnterAmount
source: Please enter an amount
he: אנא הזן סכום

# pleaseEnterValidNumber
source: Please enter a valid number
he: אנא הזן מספר תקין

# pleaseEnterDescription
source: Please enter a description
he: אנא הזן תיאור

# descriptionHintExpense
source: e.g., Lunch at Cafe
he: לדוגמה: ארוחת צהריים בקפה

source: Add Receipt Photo
he: הוסף תמונת קבלה

source: Receipt photo coming soon!
he: תמונת קבלה בקרוב!

source: Split this expense?
he: לפצל הוצאה זו?

# selectTripMembersToSplit
source: Select trip members to split with
he: בחר חברי טיול לפיצול

# noTripMembersToSplit
source: No trip members to split with. Create a trip first!
he: אין חברי טיול לפיצול. צור טיול קודם!

source: Notes (optional)
he: הערות (אופציונלי)

# additionalDetails
source: Any additional details...
he: פרטים נוספים...

source: Countries
he: מדינות

# helpAndSupport
source: Help & Support
he: עזרה ותמיכה

source: Free Plan
he: תכנית חינם

# upgradeUnlockFeatures
source: Upgrade to unlock unlimited trips and AI features
he: שדרג כדי לפתוח טיולים ללא הגבלה ותכונות AI

source: Upgrade
he: שדרג

# signOutConfirmation
source: Are you sure you want to sign out?
he: האם אתה בטוח שברצונך להתנתק?

source: Failed to sign out
he: ההתנתקות נכשלה

source: Not signed in
he: לא מחובר

source: Traveler
he: מטייל

# memberSince
source: Member since {date}
he: חבר מאז {date}

source: Trip Members
he: משתתפי הטיול

source: Share Invite Code
he: שתף קוד הזמנה

source: Invite Code
he: קוד הזמנה

source: Copy Code
he: העתק קוד

source: Code copied!
he: הקוד הועתק!

source: Join Trip
he: הצטרף לטיול

source: Enter invite code
he: הזן קוד הזמנה

# joinTripSuccess
source: Successfully joined trip!
he: הצטרפת לטיול בהצלחה!

source: Invalid invite code
he: קוד הזמנה לא תקין

# alreadyMember
source: You're already a member of this trip
he: אתה כבר משתתף בטיול הזה

source: Shared with you
he: שותף איתך

source: Leave Trip
he: עזוב טיול

source: Remove Member
he: הסר משתתף

# confirmLeaveTrip
source: Are you sure you want to leave this trip?
he: האם אתה בטוח שברצונך לעזוב את הטיול?

# tripOwner
source: Owner
he: מארגן

# tripMember
source: Member
he: משתתף

# inviteFriendsToTrip
source: Invite friends to collaborate on this trip!
he: הזמן חברים לשתף פעולה בטיול!

# noOtherMembers
source: No other members yet
he: עדיין אין משתתפים נוספים

# shareCodeDescription
source: Share this code with friends so they can join your trip and collaborate on planning!
he: שתף קוד זה עם חברים כדי שיוכלו להצטרף לטיול ולשתף פעולה בתכנון!

# shareCodeInfo
source: Anyone with this code can join your trip and add expenses, edit the itinerary, and more.
he: כל מי שיש לו קוד זה יכול להצטרף לטיול ולהוסיף הוצאות, לערוך את המסלול ועוד.

# joinTripTitle
source: Join a Trip
he: הצטרף לטיול

# joinTripDescription
source: Enter the invite code from your friend to join their trip.
he: הזן את קוד ההזמנה מהחבר שלך כדי להצטרף לטיול שלו.

source: Joining...
he: מצטרף...

# joinTripHelp
source: Ask your friend to share their trip invite code with you from the Trip Details screen.
he: בקש מהחבר שלך לשתף את קוד ההזמנה לטיול שלו ממסך פרטי הטיול.

# invalidCodeLength
source: Code must be 8 characters
he: הקוד חייב להכיל 8 תווים

# cannotJoinOwnTrip
source: You can't join your own trip
he: לא ניתן להצטרף לטיול שלך עצמך

source: Invite Friends
he: הזמן חברים

# sharedTrip
source: Shared
he: משותף

source: Export Journal
he: ייצא יומן

source: Choose export format:
he: בחר פורמט ייצוא:

# exportPdf
source: PDF Journal
he: יומן PDF

# exportText
source: Text (.txt)
he: טקסט (.txt)

# generatingPdf
source: Generating your beautiful journal...
he: יוצר את היומן היפהפה שלך...

source: Export failed
he: הייצוא נכשל
